Repository: AlessioGiambrone/stackistry
Catalog: lang/*/LC_MESSAGES/stackistry.po
Languages: pl_pl

source: Active
pl_pl: Aktywna

source: Index
pl_pl: Indeks

source: Activate all
pl_pl: Aktywuj wszystkie

source: Synchronize frame list with slider
pl_pl: Synchronizuj listę klatek z suwakiem

source: Cancel
pl_pl: Anuluj

source: Select frames for processing
pl_pl: Wybór klatek do przetwarzania

source: fast
pl_pl: szybka

source: good
pl_pl: dobra

source: best
pl_pl: najlepsza

source: Image interpolation method used when zoom level is not 100%; “fast” has the lowest quality, “best” is the slowest
pl_pl: Metoda interpolacji używana przy skali różnej od 100%; „szybka” ma najsłabszą jakość, „najlepsza” jest najwolniesza

source: quality:
pl_pl: jakość:

source: Zoom:
pl_pl: Powiększenie:

source: Fit
pl_pl: Rozc

source: Fit in window
pl_pl: Rozciągnij obraz do wielkości okna

source: Add image series
pl_pl: Dodaj serię obrazów

source: All files
pl_pl: Wszystkie pliki

source: Error
pl_pl: Błąd

source: At least two image files are required.
pl_pl: Wymagane są co najmniej dwa pliki

source: Waiting
pl_pl: Oczekiwanie

source: Error loading the first image of %1: %2
pl_pl: Błąd podczas ładowania pierwszego obrazu %1: %2

source: Idle
pl_pl: Bezczynny

source: Set video stabilization anchors
pl_pl: Wybierz punkty kotwiczące stabilizacji wideo

source: Automatic placement should work reliably in most cases. Otherwise, click the image to place anchors (one anchor is sufficient if there is not much image drift).
pl_pl: Rozmieszczanie automatyczne powinno działać zadowalająco w większości przypadków. Jeśli tak nie jest, dodaj punkty kotwiczące klikając na obraz (wystarczy jeden punkt, jeśli nie występuje nadmierny dryf).

source: Save stacked image
pl_pl: Zapisz stack

source: Error saving output image %1: %2
pl_pl: Błąd podczas zapisu obrazu wynikowego %1: %2

source: Add video(s)
pl_pl: Dodaj plik(i) wideo

source: Could not open video file %1: %2
pl_pl: Nie można otworzyć pliku wideo %1: %2

source: _File
pl_pl: _Plik

source: Add image series...
pl_pl: Dodaj serię obrazów...

source: Add image series from folder(s)...
pl_pl: Dodaj serię obrazów z folder(ów)...

source: Add video(s)...
pl_pl: Dodaj plik(i) wideo...

source: Save stacked image...
pl_pl: Zapisz stack...

source: Create flat-field from video...
pl_pl: Wygeneruj flat z wideo...

source: _Edit
pl_pl: _Edycja

source: Set video stabilization anchors...
pl_pl: Ustaw punkty kotwiczące stabilizacji wideo...

source: Select frames...
pl_pl: Wybierz klatki...

source: Processing settings...
pl_pl: Ustawienia przetwarzania...

source: Remove from list
pl_pl: Usuń z listy

source: Preferences...
pl_pl: Preferencje...

source: _Processing
pl_pl: P_rzetwarzanie

source: Start processing
pl_pl: Rozpocznij przetwarzanie

source: Start processing selected job(s)
pl_pl: Rozpocznij przetwarzanie wybranych zadań

source: Pause processing
pl_pl: Wstrzymaj przetwarzanie

source: Stop processing
pl_pl: Przerwij przetwarzanie

source: Show visualization
pl_pl: Pokaż wizualizację

source: Show visualization (slows down processing)
pl_pl: Pokaż wizualizację (spowalnia przetwarzanie)

source: _About
pl_pl: _O programie

source: About Stackistry...
pl_pl: O Stackistry...

source: Job
pl_pl: Zadanie

source: State
pl_pl: Stan

source: Progress
pl_pl: Postęp

source: Set reference points
pl_pl: Ustaw punkty odniesienia

source: Place reference points by left-clicking on the image. Avoid blank areas with little or no detail. Click Cancel to set points automatically.
pl_pl: Rozmieść punkty odniesienia klikając lewym przyciskiem w obrębie obrazu. Unikaj obszarów pozbawionych wyraźnych szczegółów. Wybierz Anuluj, by rozmieścić punkty automatycznie.

source: step
pl_pl: krok

source: Processed
pl_pl: Ukończone

source: Error: %1
pl_pl: Błąd: %1

source: Invalid value.
pl_pl: Nieprawidłowa wartość.

source: Information
pl_pl: Informacja

source: You have to restart Stackistry for the changes to take effect.
pl_pl: By zmiany odniosły skutek, należy uruchomić Stackistry ponownie.

source: Choose video file
pl_pl: Wybierz plik wideo

source: Error opening %1: %2
pl_pl: Błąd podczas otwierania %1: %2

source: Failed to create flat-field: %1
pl_pl: Błąd podczas tworzenia flatu: %1

source: Save flat-field
pl_pl: Zapisz flat

source: Error saving %1: %2
pl_pl: Błąd podczas zapisu %1: %2

source: version %1.%2.%3 (%4)
pl_pl: wersja %1.%2.%3 (%4)

source: This program comes with ABSOLUTELY NO WARRANTY. This is free software, licensed under GNU General Public License v3 or any later version. See the LICENSE file for details.
pl_pl: Ten program ABSOLUTNIE nie jest objęty JAKĄKOLWIEK GWARANCJĄ. Jest to wolne oprogramowanie na licencji GNU GPL w wersji 3 lub dowolnej późniejszej. Szczegóły w pliku LICENSE.

source: Built with <a href='https://github.com/GreatAttractor/libskry'>libskry</a> version %1.%2.%3 (%4).
pl_pl: Zbudowano z <a href='https://github.com/GreatAttractor/libskry'>libskry</a> w wersji %1.%2.%3 (%4).

source: Using %1 logical CPU(s).
pl_pl: Liczba używanych procesorów logicznych: %1.

source: About Stackistry
pl_pl: O Stackistry

source: Preferences
pl_pl: Preferencje

source: System language
pl_pl: Język systemu

source: User interface language:
pl_pl: Język interfejsu użytkownika:

source: Tool icon size:
pl_pl: Wielkość ikon narzędziowych:

source: Remove points
pl_pl: Usuń punkty

source: Automatic
pl_pl: Automatycznie

source: percent of the best fragments
pl_pl: procent najlepszych fragmentów

source: percent or better relative quality
pl_pl: procent jakości względnej lub wyżej

source: best fragments
pl_pl: (liczba najlepszych fragmentów)

source: disabled
pl_pl: wyłączony

source: in source video's folder
pl_pl: w folderze źródłowego wideo

source: specify folder
pl_pl: wybierz folder

source: anchors
pl_pl: punkty kotwiczące

source: image intensity centroid
pl_pl: centroid jasności

source: Processing settings
pl_pl: Ustawienia przetwarzania

source: Reference points
pl_pl: Punkty odniesienia

source: Placement:
pl_pl: Rozmieszczenie:

source: automatic
pl_pl: automatyczne

source: manual
pl_pl: ręczne

source: If set to manual, a selection dialog will be shown later during processing
pl_pl: Jeśli wybrano ręczne, w trakcie przetwarzania wyświetlone zostanie okno dialogowe wyboru punktów

source: Relative local contrast level required to place a reference point; value of 1.2 usually works well
pl_pl: Względny poziom lokalnego kontrastu wymagany dla umieszczenia punktu odniesienia; wartość 1,2 jest zazwyczaj odpowiednia

source: Pixel size of the smallest structures. Should equal 1 for optimally-sampled or undersampled images. Use higher values for oversampled (blurry) material.
pl_pl: Wielkość (w pikselach) najmniejszych szczegółów. Należy wybrać 1 dla obrazów z optymalnym próbkowaniem, a dla nadpróbkowanych (rozmytych) – wartość odpowiednio wyższą.

source: spacing in pixels:
pl_pl: odstęp w pikselach:

source: brightness threshold (%):
pl_pl: próg jasności (%):

source: structure threshold:
pl_pl: próg wykrywania szczegółów:

source: structure scale:
pl_pl: skala szczegółów:

source: Reference block size:
pl_pl: Wielkość bloku odniesienia:

source: Search radius:
pl_pl: Promień szukania:

source: Settings for job(s):
pl_pl: Ustawienia dla zadań:

source: Video stabilization method:
pl_pl: Metoda stabilizacji wideo:

source: anchor placement:
pl_pl: rozmieszczenie:

source: Stacking criterion:
pl_pl: Kryterium stackowania:

source: Save stacked image automatically:
pl_pl: Automatyczny zapis stacku:

source: Output format:
pl_pl: Format wyjściowy:

source: Use flat-field for stacking:
pl_pl: Użyj flatu:

source: Select flat-field image
pl_pl: Wybierz flat

source: Treat mono input as raw color:
pl_pl: Traktuj materiał mono jako „raw color”:

source: (also overrides raw color format in SER videos)
pl_pl: (wymusza również format „raw color” dla plików SER)

source: BMP 8-bit
pl_pl: BMP 8-bitowy

source: TIFF 16-bit (uncompressed)
pl_pl: TIFF 16-bitowy (nieskompresowany)

source: PNG 8-bit
pl_pl: PNG 8-bitowy

source: Success
pl_pl: Operacja powiodła się

source: Invalid parameters
pl_pl: Błędne parametry

source: Last step
pl_pl: Ostatni krok

source: No more images
pl_pl: Nie ma więcej obrazów

source: No palette
pl_pl: Brak palety

source: Cannot open file
pl_pl: Nie można otworzyć pliku

source: Malformed BMP file
pl_pl: Nieprawidłowa struktura pliku BMP

source: Unsupported BMP file
pl_pl: Nieobsługiwany plik BMP

source: Unsupported file format
pl_pl: Nieobsługiwany format pliku

source: Out of memory
pl_pl: Brak pamięci

source: Cannot create file
pl_pl: Nie można utworzyć pliku

source: Incomplete TIFF header
pl_pl: Niekompletny nagłówek TIFF

source: Unknown TIFF version
pl_pl: Nieznana wersja TIFF

source: Incomplete TIFF tag: number of directory entries
pl_pl: Niekompletny tag TIFF: liczba wpisów w skorowidzu

source: Incomplete TIFF field
pl_pl: Niekompletne pole TIFF

source: Channels have different bit depths
pl_pl: Kanały różnią się głębią bitową

source: TIFF compression is not supported
pl_pl: Kompresja TIFF nie jest obsługiwana

source: Unsupported TIFF planar configuration
pl_pl: Nieobsługiwana konfiguracja płatowa w pliku TIFF

source: Unsupported pixel format
pl_pl: Nieobsługiwany format pikseli

source: Incomplete TIFF pixel data
pl_pl: Niekompletne dane wartości pikseli w pliku TIFF

source: Malformed AVI file
pl_pl: Nieprawidłowa struktura pliku AVI

source: Unsupported AVI video format
pl_pl: Nieobsługiwany format wideo

source: Invalid image dimensions
pl_pl: Błędny rozmiar obrazu

source: Malformed SER file
pl_pl: Nieprawidłowa struktura pliku SER

source: Unsupported SER format
pl_pl: Nieobsługiwany format SER

source: Unknown error
pl_pl: Nieznany błąd

source: Image alignment
pl_pl: Stabilizacja obrazu

source: Quality estimation
pl_pl: Szacowanie jakości

source: Reference point alignment
pl_pl: Śledzenie punktów odniesienia

source: Image stacking
pl_pl: Stacking
